examples/dfLowMachFoam/paddle/oneD_freelyPropagation/C2H4/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;

setFormat       raw;

sets
(
    data
    {
        type    lineUniform;
        axis    x;
        start   (0.00103    0 0);
        end     (0.0014 0 0);
        nPoints 15;
    }

);

fields          ( T OH C2H4 CO2 H2O);

// ************************************************************************* //

